# Quiz) M4U大学のCoding学科教授である。
# 成績を決める基準は下記の内容である。

# -出席 10
# -Quiz1 10
# -Quiz2 10
# -中間テスト 10
# -期末テスト 10
# - プロジェクト 20

# ------------------
# -合計 100

# 最後の授業を終えて、学生の成績を検討しているうち、Quiz2の問題に間違いがあり、全部満点処理をすることになりました。
# 現在、作られた成績データを下記のように修正してください。

# 1.Quiz2の点数をすべて10に修正
# 2.H例に総点(SUM利用), I列に成績情報追加
# - 総点90点以上 A, 80点以上 B, 70点以上 C, その他 D
# 3.出席が 5未満の学生は総点関係なく F

# *最終ファイル名:scroes.xlsx

# 現在、作成された最終成績データ

# 学番, 出席, Quiz1, Quiz2, 中間テスト, 期末テスト, プロジェクト

# 1, 10, 8, 5, 14, 26, 12
# 2, 7, 3, 7, 15, 24, 18
# 3, 9, 6, 8, 8, 12, 4
# 4, 7, 8, 7, 17, 21, 18
# 5, 7, 8, 7, 16, 25, 15
# 6, 3, 5, 8, 8, 17, 0
# 7, 4, 9, 10, 16, 27, 18
# 8, 6, 6, 15, 19, 17
# 9, 10, 10, 9, 19, 30, 19
# 10, 9, 8, 8, 20, 25, 20
